# Delete Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DocumentEntryPoint..::..Delete Method
DocumentEntryPoint Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Delete(ElementId) | Deletes an element from the document given the id of that element.  (Inherited from Document.) |
| Delete(ICollection<(Of <<'(ElementId>)>>)) | Deletes a set of elements from the document.  (Inherited from Document.) |

# See Also
DocumentEntryPoint Class
DocumentEntryPoint Members
Autodesk.Revit.DB.Macros Namespace